CaseLabGreenatom/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.РеквизитыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CaseLabGreenatom/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемУпаковки</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ингредиенты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CaseLabGreenatom/src/Documents/УстановкаЦен/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Согласовано.Доступность = РольДоступна("ПолныеПрава");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СогласованоПриИзменении(Элемент)
	
	Если Не Объект.Согласовано Тогда
		
		Элементы.Дата.Доступность = Ложь;
		Элементы.Номер.Доступность = Ложь;
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.Цены.Доступность = Ложь;
		
	Иначе 
		
		Элементы.Дата.Доступность = Истина;
		Элементы.Номер.Доступность = Истина;
		Элементы.Контрагент.Доступность = Истина;
		Элементы.Ответственный.Доступность = Истина;
		Элементы.Комментарий.Доступность = Истина;
		Элементы.Цены.Доступность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		
		Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, КонецДня(Объект.Дата));
		ИзмененнаяСтрока.ЦенаБезНДС = Цена;
		
	Иначе
				
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦены

&НаКлиенте
Процедура ЦеныЦенабезНДСПриИзменении(Элемент)
	
	ПриИзмененииЦеныБезНДС(Элементы.Цены.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрокаТабличнойЧасти = Элементы.Цены.ТекущиеДанные;
	ПриИзмененииНоменклатуры(ТекущаяСтрокаТабличнойЧасти);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ВыбраннаяНоменклатура Из ВыбранноеЗначение Цикл
		
		СуществующиеСтроки = Объект.Цены.НайтиСтроки(Новый Структура("Номенклатура", ВыбраннаяНоменклатура));
		
		Если СуществующиеСтроки.Количество() >= 1 Тогда
			
			Возврат;
			
		КонецЕсли;
		
		НоваяСтрокаТабличнойЧасти = Объект.Цены.Добавить();
		НоваяСтрокаТабличнойЧасти.Номенклатура = ВыбраннаяНоменклатура;
		ПриИзмененииНоменклатуры(НоваяСтрокаТабличнойЧасти)
     
	КонецЦикла;
   		
КонецПроцедуры

&НаКлиенте
Процедура ЦеныСтавкаНДСПриИзменении(Элемент)
	
	ПриИзмененииСтавкиНДС(Элементы.Цены.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", ПараметрыФормы, Элементы.Цены);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииЦеныБезНДС(ИзмененнаяСтрока)
	
	Если Не ЗначениеЗаполнено(ИзмененнаяСтрока.СтавкаНДС) Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	//Если ИзмененнаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
	//	
	//	СтавкаНДС = 0;
	//	
	//ИначеЕсли ИзмененнаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
	//	
	//	СтавкаНДС = 10;
	//	
	//ИначеЕсли ИзмененнаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
	//	
	//	СтавкаНДС = 20;
	//	
	//КонецЕсли;
	
	СуммаНДС = НДСКлиент.СуммаНДСПоСтавке(ИзмененнаяСтрока.ЦенаБезНДС, ИзмененнаяСтрока.СтавкаНДС);//Окр(ИзмененнаяСтрока.ЦенаБезНДС * СтавкаНДС / 100, 2);
		
	ИзмененнаяСтрока.ЦенаСНДС = ИзмененнаяСтрока.ЦенаБезНДС + СуммаНДС;
	
	ИзмененнаяСтрока.СуммаНДС = СуммаНДС;
	
КонецПроцедуры

 &НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	
	СуммаНДС = НДСКлиент.СуммаНДСПоСтавке(ИзмененнаяСтрока.ЦенаБезНДС, ИзмененнаяСтрока.СтавкаНДС);
	
	ИзмененнаяСтрока.ЦенаСНДС = ИзмененнаяСтрока.ЦенаБезНДС + СуммаНДС;
	
	ИзмененнаяСтрока.СуммаНДС = СуммаНДС;
	
КонецПроцедуры

#КонецОбласти
